<?php
$regions = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Рыбное', 'Солотча'],
    'Тульская область' => ['Тула', 'Плеханово', 'Щёкино'],
];
foreach ($regions as $key => $region) {
    echo "<br><br>$key:<br>";
    foreach ($region as $city) {
        if (end($region) === $city) {
            echo "$city.";
            break;
        }
        echo "$city, ";

    }
}